In [2]:
import seaborn as sns 
import matplotlib.pyplot as plt 
import numpy as np 
import pandas as pd 
print('libraries imported!')

libraries imported!

In [3]:
## to get the dataset   
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
## to get the dataset   
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [6]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [9]:
df = tips

In [11]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [17]:
# df.rename()  
df.columns  = ['bill', 'tip', 'gender', 'smoking', 'day', 'time', 'size']

In [18]:
df.head()  # smoking   no. of person smoking 244 
# value_counts()

    bill   tip  gender smoking  day    time  size
0  16.99  1.01  Female      No  Sun  Dinner     2
1  10.34  1.66    Male      No  Sun  Dinner     3
2  21.01  3.50    Male      No  Sun  Dinner     3
3  23.68  3.31    Male      No  Sun  Dinner     2
4  24.59  3.61  Female      No  Sun  Dinner     4

In [21]:
df['smoking'].unique()

['No', 'Yes']
Categories (2, object): ['Yes', 'No']

In [22]:
df['smoking'].value_counts()

smoking
No     151
Yes     93
Name: count, dtype: int64

In [24]:
df['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [25]:
df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [28]:
df['day'].unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [29]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [30]:
Sat     87   === > smoker no / yes

      bill   tip  gender smoking   day    time  size
0    16.99  1.01  Female      No   Sun  Dinner     2
1    10.34  1.66    Male      No   Sun  Dinner     3
2    21.01  3.50    Male      No   Sun  Dinner     3
3    23.68  3.31    Male      No   Sun  Dinner     2
4    24.59  3.61  Female      No   Sun  Dinner     4
..     ...   ...     ...     ...   ...     ...   ...
239  29.03  5.92    Male      No   Sat  Dinner     3
240  27.18  2.00  Female     Yes   Sat  Dinner     2
241  22.67  2.00    Male     Yes   Sat  Dinner     2
242  17.82  1.75    Male      No   Sat  Dinner     2
243  18.78  3.00  Female      No  Thur  Dinner     2

[244 rows x 7 columns]